public class Description {
    public static void main(String[] args) {
        //1.Деклариране и инициализиране на многомерен масив:
        /**Декларирането на многомерен масив става като се добавят
         *  допълнителни двойни квадратни скоби  TODO [ ]
         *  за всяко измерение.Например , за двумерен масив :
         *
         */
        int [][]matrix;
        или
        int matrix [][] ;

        /**Инициализация с предварително зададени стойности*/
        int[][] matrix = {
                {1, 2, 3},//ред 0
                {4, 5, 6},//ред 1
                {7, 8, 9},//ред 2
        };
        /**Инициализиране с указване на размера:
         * Ако знаеш размера на масива, но не и неговите стойности , можем да го инициализираме , като посочим броя на редовете и колоните .
         */
         int[][]matrix=new int[3][4];//Масив с 3 реда и 4 колони

        /**Достъп до елементите на многомерен масив */
        int [][]matrix={
                {1,2,3},
                {4,5,6}
        };

        //Достъп до елемент на ред 1 , колона 2
        int element=matrix[1][2];//Стойността ще бъде 6

        //Промяна на стойноста на елемента
        matrix[0][0]=10;//Сега първият елемент е 10
        /**Дължина на многомерен масив:*/

        /**matrix.length - връща броя редове .*/

        /**matrix[1].length - връща броя на колоните в i-тия ред.*/
        int [][] matrix={
                {1,2,3},
                {4,5,5},
                {7,8,9}
        };
        int rows=matrix.length;//rows = 2
        int cols=matrix[1].length;//cols = 3 (дължината на първия ред)

        /**Jagged масиви:
         * Можем да създаваме масив , в който всеки ред има различен брой колони
         */
        int[][] jaggedArray = new int[3][];
        //Инициализиране на всеки ред с ралична дължина
        jaggedArray[0] = new int[2];//Първият ред има 2 колони
        jaggedArray[1] = new int[3];//Вторият ред има 3 колони
        jaggedArray[2] = new int[5];//Третият ред има 5 колони

        /**Обхождане на многомерен масив
         За да обходим всички елементи на многомерен масив , обикновено се използва вложени цикли for.
         Външният цикъл обхожда редовете, а вътрешният – колоните.
         */
         /**С обикновен  for цикъл: */
        int [][] matrix={
                {1,2,3},
                {4,5,6},
                {7,8,9}
        };
        for (int row = 0; row < matrix.length; row++) {//Обхождане на редовете
            for (int col = 0; col < matrix[row].length; col++) {//Обхождане на колоните в текущия ред
                System.out.print(matrix[row][col]+" ");
            }
            System.out.println();//Нов ред след всеки ред на матрица
        }
        /**С разширен for  цикъл (for-each)*/

        int[][]matrix={
                {1,2,3},
                {4,5,6}
        };
        for (int[]row:matrix){//За всеки ред  (който е масив от int)
            for (int element:row){//За всеки елемент в текущия ред
                System.out.print(element+" ");
            }
            System.out.println();
        }



    }
}
